src/InformationRegisters/ЗаданияКРасчетуДлительностиПроизводства/ЗаданияКРасчетуДлительностиПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаданияКРасчетуДлительностиПроизводства</name>
  <attributes>
    <name>ПолныйРасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетДнейДоОкончания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектРасчета</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Календари</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьНомерЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьДеньРегистрации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЗаданияКРасчетуДлительностиПроизводства/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет записи в регистр заданий.
//
// Параметры:
//  ОбъектРасчета	 - СправочникОбъект.ОбъектыРасчетов  - справочник, для которого необходимо добавить задание.
//  ПолныйРасчет	 - Булево							 - признак, необходимо рассчитать нормативную длительность этапов производства.
//  Автозапуск		 - Булево							 - автоматический запуск.
//
Процедура ДобавитьЗадание(ОбъектРасчета, ПолныйРасчет = Ложь, Автозапуск = Истина) Экспорт
	
	Задание = Новый Структура;
	Задание.Вставить("ОбъектРасчета", ОбъектРасчета);
	Задание.Вставить("ПолныйРасчет",  ПолныйРасчет);
	
	ТаблицаЗаданий = ОтложенныеЗадания.ДобавитьЗаданияВОчередь("ЗаданияКРасчетуДлительностиПроизводства", Задание);
	
	Если Автозапуск Тогда
		
		ОтложенныеЗадания.Запустить(ТаблицаЗаданий);
		
	КонецЕсли;
	
КонецПроцедуры

// Запускает планирование производства
//
// Параметры:
//  Отбор - Неопределено, см. ОтложенныеЗадания.ИдентификаторыЗаписей.Отбор
//
Процедура ЗапуститьЗадание(Отбор = Неопределено) Экспорт
	
	Очередь = "ЗаданияКРасчетуДлительностиПроизводства";
	
	Если ЗначениеЗаполнено(Отбор) Тогда
		
		ТаблицаЗаданий = ОтложенныеЗадания.ИнициализироватьТаблицуЗаданий();
		
		СтрокаТаблицы = ТаблицаЗаданий.Добавить();
		СтрокаТаблицы.Очередь               = Очередь;
		СтрокаТаблицы.ИдентификаторыЗаписей = ОтложенныеЗадания.ИдентификаторыЗаписей(Очередь, Отбор);
		
		ОтложенныеЗадания.Запустить(ТаблицаЗаданий);
		
	Иначе
		
		ОтложенныеЗадания.Запустить(Очередь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
